maya-taylor/Project2ELEC291/JDY40 EFM8 Files/EFM8 Example Code/Servo_Tester/Servo_Tester.c
//  EFM8_Servo.c: Uses timer 5 interrupt to generate a servo motor control signal.
//
//  Copyright (c) 2010-2018 Jesus Calvino-Fraga
//  ~C51~

#include <EFM8LB1.h>
#include <stdlib.h>
#include <stdio.h>

volatile unsigned int servo_counter=0;
volatile unsigned char servo1=150, servo2=150;

#define SERVO1 P1_2
#define SERVO2 P1_3

#define SYSCLK 72000000L // SYSCLK frequency in Hz
#define BAUDRATE 115200L
#define RELOAD_10us (0x10000L-(SYSCLK/(12L*100000L))) // 10us rate

char _c51_external_startup (void)
{
	// Disable Watchdog with key sequence
	SFRPAGE = 0x00;
	WDTCN = 0xDE; //First key
	WDTCN = 0xAD; //Second key
  
	VDM0CN |= 0x80;
	RSTSRC = 0x02;

	#if (SYSCLK == 48000000L)	
		SFRPAGE = 0x10;
		PFE0CN  = 0x10; // SYSCLK < 50 MHz.
		SFRPAGE = 0x00;
	#elif (SYSCLK == 72000000L)
		SFRPAGE = 0x10;
		PFE0CN  = 0x20; // SYSCLK < 75 MHz.
		SFRPAGE = 0x00;
	#endif
	
	#if (SYSCLK == 12250000L)
		CLKSEL = 0x10;
		CLKSEL = 0x10;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 24500000L)
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 48000000L)	
		// Before setting clock to 48 MHz, must transition to 24.5 MHz first
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
		CLKSEL = 0x07;
		CLKSEL = 0x07;
		while ((CLKSEL & 0x80) == 0);
	#elif (SYSCLK == 72000000L)
		// Before setting clock to 72 MHz, must transition to 24.5 MHz first
		CLKSEL = 0x00;
		CLKSEL = 0x00;
		while ((CLKSEL & 0x80) == 0);
		CLKSEL = 0x03;
		CLKSEL = 0x03;
		while ((CLKSEL & 0x80) == 0);
	#else
		#error SYSCLK must be either 12250000L, 24500000L, 48000000L, or 72000000L
	#endif
	
	// Configure the pins used servo PWM
	P1MDOUT|=0b_0000_1100;
	P0MDOUT |= 0x10; // Enable UART0 TX as push-pull output
	XBR0     = 0x01; // Enable UART0 on P0.4(TX) and P0.5(RX)                     
	XBR1     = 0X10; // Enable T0 on P0.0
	XBR2     = 0x40; // Enable crossbar and weak pull-ups

	#if (((SYSCLK/BAUDRATE)/(2L*12L))>0xFFL)
		#error Timer 0 reload value is incorrect because (SYSCLK/BAUDRATE)/(2L*12L) > 0xFF
	#endif
	// Configure Uart 0
	SCON0 = 0x10;
	CKCON0 |= 0b_0000_0000 ; // Timer 1 uses the system clock divided by 12.
	TH1 = 0x100-((SYSCLK/BAUDRATE)/(2L*12L));
	TL1 = TH1;      // Init Timer1
	TMOD &= ~0xf0;  // TMOD: timer 1 in 8-bit auto-reload
	TMOD |=  0x20;                       
	TR1 = 1; // START Timer1
	TI = 1;  // Indicate TX0 ready

	// Initialize timer 5 for periodic interrupts
	SFRPAGE=0x10;
	TMR5CN0=0x00;
	TMR5=0xffff;   // Set to reload immediately
	EIE2|=0b_0000_1000; // Enable Timer5 interrupts
	TR5=1;         // Start Timer5 (TMR5CN0 is bit addressable)
	
	EA=1;
	
	SFRPAGE=0x00;
	
	return 0;
}

void Timer5_ISR (void) interrupt INTERRUPT_TIMER5
{
	SFRPAGE=0x10;
	TF5H = 0; // Clear Timer5 interrupt flag
	TMR5RL=RELOAD_10us;
	servo_counter++;
	if(servo_counter==2000)
	{
		servo_counter=0;
		SERVO1=1;
		SERVO2=1;
	}
	if(servo1==servo_counter)
	{
		SERVO1=0;
	}
	if(servo2==servo_counter)
	{
		SERVO2=0;
	}
}

// Uses Timer3 to delay <us> micro-seconds. 
void Timer3us(unsigned char us)
{
	unsigned char i;               // usec counter
	
	// The input for Timer 3 is selected as SYSCLK by setting T3ML (bit 6) of CKCON0:
	CKCON0|=0b_0100_0000;
	
	TMR3RL = (-(SYSCLK)/1000000L); // Set Timer3 to overflow in 1us.
	TMR3 = TMR3RL;                 // Initialize Timer3 for first overflow
	
	TMR3CN0 = 0x04;                 // Sart Timer3 and clear overflow flag
	for (i = 0; i < us; i++)       // Count <us> overflows
	{
		while (!(TMR3CN0 & 0x80));  // Wait for overflow
		TMR3CN0 &= ~(0x80);         // Clear overflow indicator
	}
	TMR3CN0 = 0 ;                   // Stop Timer3 and clear overflow flag
}

void waitms (unsigned int ms)
{
	unsigned int j;
	for(j=ms; j!=0; j--)
	{
		Timer3us(249);
		Timer3us(249);
		Timer3us(249);
		Timer3us(250);
	}
}

void TIMER0_Init(void)
{
	TMOD&=0b_1111_0000; // Set the bits of Timer/Counter 0 to zero
	TMOD|=0b_0000_0001; // Timer/Counter 0 used as a 16-bit timer
	TR0=0; // Stop Timer/Counter 0
}


void main (void)
{ 
	unsigned char j;
	
    waitms(500); // Give PuTTY time to start
	printf("\x1b[2J\x1b[1;1H"); // Clear screen using ANSI escape sequence.

	printf ("Servo Tester.\n"
	        "File: %s\n"
	        "Compiled: %s, %s\n\n",
	        __FILE__, __DATE__, __TIME__);
	
	TIMER0_Init();

	while(1)
	{
		if(P2_0==0)
		{
			waitms(50);		
			if(P2_0==0)
			{
				while(P2_0==0);
				servo1=60;
				servo2=60;
			}
		}
		
		if(P1_7==0)
		{
			waitms(50);		
			if(P1_7==0)
			{
				while(P1_7==0);
				servo1=100;
				servo2=100;
			}
		}
		
		if(P1_6==0)
		{
			waitms(50);		
			if(P1_6==0)
			{
				while(P1_6==0);
				servo1=150;
				servo2=150;
			}
		}
		
		if(P1_5==0)
		{
			waitms(50);		
			if(P1_5==0)
			{
				while(P1_5==0);
				servo1=200;
				servo2=200;
			}
		}
		
		if(P1_4==0)
		{
			waitms(50);		
			if(P1_4==0)
			{
				while(P1_4==0);
				servo1=240;
				servo2=240;
			}
		}
		
		if(P3_7==0)
		{
			waitms(50);		
			if(P3_7==0)
			{
				while(P3_7==0);
				while(1)
				{
					for(j=60; j<240; j++)
					{
						if( ( P2_0 & P1_7 & P1_6 & P1_5 & P1_4 ) == 0)
						{
							break;
						}
						servo1=j;
						servo2=j;
						waitms(10);
					}
					for(j=240; j>60; j--)
					{
						if( ( P2_0 & P1_7 & P1_6 & P1_5 & P1_4 ) == 0)
						{
							break;
						}
						servo1=j;
						servo2=j;
						waitms(10);
					}
					if( ( P2_0 & P1_7 & P1_6 & P1_5 & P1_4 ) == 0)
					{
						break;
					}
				}
			}
		}
	}
}
